from statsmodels.tsa.stattools import adfuller
import pandas as pd
import numpy as np

df = pd.read_csv("000001.SZ.csv")
# ADF检验
result = adfuller(df["close"])
print(result)
# 一阶差分后再做ADF检验
result = adfuller(np.diff(df["close"]))
print(result)
"""
针对结果第一个是统计值，第二个是p-value,值原假设为真的前提下，得到该检验结果的概率，p-value越接近0越可能平稳；
统计值小于1%置信水平下的临界值则有99%的概率是平稳的。
(-0.6716691627358793, 0.8539520362615489, 9, 476, {'1%': -3.444162847239118, '5%': -2.8676311169658177, '10%': -2.5700143303792107}, 34.23244250381447)
(-6.874114910359974, 1.489675611491205e-09, 8, 476, {'1%': -3.444162847239118, '5%': -2.8676311169658177, '10%': -2.5700143303792107}, 31.972636319895628)
"""
