from statsmodels.tsa.stattools import q_stat
import statsmodels.tsa.api as smt
import numpy as np

n_sample = 1000
# 白噪声过程
w = np.random.normal(size=n_sample)
# LB检验白噪声
result = q_stat(smt.acf(w, nlags=30)[1:], len(w))
print(result)
# 结果分析
"""
因为q_stat函数进行检验时是一层层地计算的。例如我们对30阶的系数进行检验，它会先对第一阶的系数进行检验，然后对第一阶和第二阶的系数进行检验，
最后对这30阶的系数进行检验。因此，我们只需要参考每个数组的最后输出即可。即得到的检验统计值是19.62953886，对应的p-value是 0.92583174，可以看出p-value明显
大于0.05，所以无法拒绝原假设，也就是说，原序列是白噪声序列。
(array([ 0.06583569,  0.09801376,  3.84847703,  4.24344502,  4.6878078 ,
        4.78957051,  4.79921952,  5.0156876 ,  5.03651157,  6.13540917,
        6.14630983,  6.15316509,  6.17641262,  6.31471644,  6.44680266,
        6.56595982,  8.95468409,  9.09846981,  9.34321698, 10.42175544,
       14.30600304, 15.17221611, 15.24275734, 16.30679175, 16.42905812,
       16.4386664 , 17.38619102, 17.69861872, 18.5651927 , 19.62953886]), array([0.79749941, 0.95217458, 0.27829757, 0.37406056, 0.45515506,
       0.57107178, 0.68444999, 0.75589811, 0.83111391, 0.80376129,
       0.86342571, 0.9081649 , 0.93949597, 0.95792484, 0.9712264 ,
       0.98074869, 0.94167273, 0.95741781, 0.96733413, 0.95986403,
       0.85609971, 0.85474186, 0.88572237, 0.87668534, 0.90145123,
       0.92506341, 0.92116196, 0.93348735, 0.93193039, 0.92583174]))
"""
